---
kind: other
id: Methods.T:Autodesk.Revit.DB.TilePatterns
source: html/3190ff0c-889f-934d-6a21-2116304603d9.htm
---
# TilePatterns Methods

Causes the object to release immediately any resources it may be utilizing.